Конфигурация/Documents/РегистрацияФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегистрацияФинансовыхПоказателей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФинансовыеПоказатели</xr:Item>
				<xr:Item>InformationRegister.ПоказателиДеятельности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФинансовыеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КатегорииПрофессиональныхУчастниковРынкаЦенныхБумаг</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДатыЗапретаРедактирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДатыЗапретаРедактирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапретаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыЗапретаРедактирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/РегистрацияФинансовыхПоказателей/Ext/ManagerModule.bsl
Функция РассчитатьФинансовыеПоказателиСтандартнойСтратегии(Организация, Стратегия, Период, РасшифровкаРасчета = Ложь) Экспорт
	
	Если ТипЗнч(Стратегия) <> Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования") Тогда
		ВызватьИсключение "Расчет финансовых показателей стандартной стратегии поддерживается только по стратегиям индивидуального инвестирования";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период",			КонецДня(Период));
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Стратегия",		Стратегия);
	
	#Область Расчет_общей_стоимости_портфелей_стратегии_на_дату_расчета 
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(&Период, Организация = &Организация) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|ГДЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия = &Стратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.Регистратор КАК Регистратор,
		|	ФинансовыеПоказатели.СубъектАналитики КАК СДУ,
		|	ФинансовыеПоказатели.Значение КАК СЧА
		|ПОМЕСТИТЬ _СтоимостьЧистыхАктивов
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.СубъектАналитики В
		|			(ВЫБРАТЬ
		|				_СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			ИЗ
		|				_СчетаДоверительногоУправления)
		|	И ФинансовыеПоказатели.Организация = &Организация
		|	И ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
		|	И ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СУММА(_СтоимостьЧистыхАктивов.СЧА), 0) КАК СтоимостьПортфеля
		|ИЗ
		|	_СтоимостьЧистыхАктивов КАК _СтоимостьЧистыхАктивов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СтоимостьПортфеля) Тогда
		СтоимостьПортфеля = Выборка.СтоимостьПортфеля;
	Иначе
		ВызватьИсключение "Расчет на " + Формат(Период, "ДЛФ=DD") + " невозможен, т.к. стоимость портфеля на данную дату не зарегистрирована!";
	КонецЕсли;	
	
	Если РасшифровкаРасчета Тогда
		
		РасшифровкаСтоимостиПортфеля = Новый Массив;
		
		Выборка = Запрос.МенеджерВременныхТаблиц.Таблицы["_СтоимостьЧистыхАктивов"].ПолучитьДанные().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗаписьРасшифровки = Новый Структура;
			
			ЗаписьРасшифровки.Вставить("СДУ",			Выборка.СДУ);
			ЗаписьРасшифровки.Вставить("СЧА",			Формат(Выборка.СЧА, "ЧДЦ=2"));
			ЗаписьРасшифровки.Вставить("Регистратор",	Выборка.Регистратор);
			
			РасшифровкаСтоимостиПортфеля.Добавить(ЗаписьРасшифровки);
			
		КонецЦикла;

	КонецЕсли;
	
	#КонецОбласти
	
	#Область Получение_имущества_переданного_в_управление
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ) КАК Период,
		|	ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ВводыВыводыАктивовВВалютеУчета.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ * ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость КАК Сумма,
		|	ВводыВыводыАктивовВВалютеУчета.ВидАктива КАК ВидАктива,
		|	ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения КАК НаправлениеДвижения,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ) + 1 КАК ДнейВУправлении,
		|	ВводыВыводыАктивовВВалютеУчета.Регистратор КАК Операция,
		|	ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ПО (ВводыВыводыАктивовВВалютеУчета.Организация = &Организация)
		|			И ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (ВводыВыводыАктивовВВалютеУчета.Период <= КОНЕЦПЕРИОДА(&Период, ДЕНЬ))
		|			И (ВводыВыводыАктивовВВалютеУчета.Активность)";
	
	// Определим переданную и среднюю стоимости имущества
	
	Операции = Новый Массив;
	
	СредняяСтоимостьИмуществаПереданногоВУправление = 0;
	СтоимостьИмуществаПереданногоВУправление        = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтоимостьИмуществаПереданногоВУправление		= СтоимостьИмуществаПереданногоВУправление + Выборка.Сумма;
		СредняяСтоимостьИмуществаПереданногоВУправление	= СредняяСтоимостьИмуществаПереданногоВУправление + Выборка.Сумма * Выборка.ДнейВУправлении;
		
		Если РасшифровкаРасчета Тогда
			
			Операция = Новый Структура;
			Операция.Вставить("ДатаОперации",	Формат(Выборка.Период, "ДЛФ=D"));
			Операция.Вставить("Документ",		Выборка.Операция);
			Операция.Вставить("СчетДУ",			Выборка.СчетДоверительногоУправления);
			Операция.Вставить("Сумма",			Формат(Выборка.Сумма, "ЧДЦ=2"));
			Операция.Вставить("ДнейОсталось",	Формат(Выборка.ДнейВУправлении, "ЧДЦ="));
			
			Операции.Добавить(Операция);
			
		КонецЕсли;
		
	КонецЦикла;	
	
	СредняяСтоимостьИмуществаПереданногоВУправление = СредняяСтоимостьИмуществаПереданногоВУправление / 365;
	
	#КонецОбласти
	
	Если РасшифровкаРасчета Тогда
		
		#Область Получение_зарегистрированных_показателей
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ФинансовыеПоказатели.ВидПоказателя КАК ВидПоказателя,
			|	ФинансовыеПоказатели.Значение КАК Значение
			|ПОМЕСТИТЬ _ТекущиеФинансовыеПоказатели
			|ИЗ
			|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
			|ГДЕ
			|	ФинансовыеПоказатели.Период = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
			|	И ФинансовыеПоказатели.ВидПоказателя В (ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доходность), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СтоимостьПортфеля), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доход), ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СреднемесячнаяДоходность))
			|	И ФинансовыеПоказатели.СубъектАналитики = &Стратегия
			|	И ФинансовыеПоказатели.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ТекущиеФинансовыеПоказатели.Значение КАК Доходность,
			|	NULL КАК СтоимостьПортфеля,
			|	NULL КАК Доход,
			|	NULL КАК СреднемесячнаяДоходностьЗарегистрировано
			|ПОМЕСТИТЬ _ЗначенияПоказателей
			|ИЗ
			|	_ТекущиеФинансовыеПоказатели КАК _ТекущиеФинансовыеПоказатели
			|ГДЕ
			|	_ТекущиеФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доходность)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	NULL,
			|	_ТекущиеФинансовыеПоказатели.Значение,
			|	NULL,
			|	NULL
			|ИЗ
			|	_ТекущиеФинансовыеПоказатели КАК _ТекущиеФинансовыеПоказатели
			|ГДЕ
			|	_ТекущиеФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СтоимостьПортфеля)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	NULL,
			|	NULL,
			|	_ТекущиеФинансовыеПоказатели.Значение,
			|	NULL
			|ИЗ
			|	_ТекущиеФинансовыеПоказатели КАК _ТекущиеФинансовыеПоказатели
			|ГДЕ
			|	_ТекущиеФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доход)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	NULL,
			|	NULL,
			|	NULL,
			|	_ТекущиеФинансовыеПоказатели.Значение
			|ИЗ
			|	_ТекущиеФинансовыеПоказатели КАК _ТекущиеФинансовыеПоказатели
			|ГДЕ
			|	_ТекущиеФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СреднемесячнаяДоходность)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(_ЗначенияПоказателей.Доходность) КАК ДоходностьЗарегистрировано,
			|	СУММА(_ЗначенияПоказателей.СтоимостьПортфеля) КАК СтоимостьПортфеляЗарегистрировано,
			|	СУММА(_ЗначенияПоказателей.Доход) КАК ДоходЗарегистрировано,
			|	СУММА(_ЗначенияПоказателей.СреднемесячнаяДоходностьЗарегистрировано) КАК СреднемесячнаяДоходностьЗарегистрировано
			|ИЗ
			|	_ЗначенияПоказателей КАК _ЗначенияПоказателей";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтоимостьПортфеляЗарегистрировано			= Выборка.СтоимостьПортфеляЗарегистрировано;
			ДоходЗарегистрировано						= Выборка.ДоходЗарегистрировано;
			ДоходностьЗарегистрировано					= Выборка.ДоходностьЗарегистрировано;
			СреднемесячнаяДоходностьЗарегистрировано	= Выборка.СреднемесячнаяДоходностьЗарегистрировано;
		Иначе
			СтоимостьПортфеляЗарегистрировано			= Неопределено;
			ДоходЗарегистрировано						= Неопределено;
			ДоходностьЗарегистрировано					= Неопределено;
			СреднемесячнаяДоходностьЗарегистрировано	= Неопределено;
		КонецЕсли;
		
		#КонецОбласти
		
	КонецЕсли;	
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#Область Расчет_среднемесячной_доходности

	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачалоПериодаСтратегии.Стратегия КАК Стратегия,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	НачалоПериодаСтратегии.Период КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(ОкончанияПериодаСтратегии.Период) < &Период
		|				И МИНИМУМ(ОкончанияПериодаСтратегии.Период) < СчетаДоверительногоУправления.ДатаРасторжения
		|			ТОГДА МИНИМУМ(ОкончанияПериодаСтратегии.Период)
		|		КОГДА КОНЕЦПЕРИОДА(СчетаДоверительногоУправления.ДатаРасторжения, ДЕНЬ) < &Период
		|			ТОГДА КОНЕЦПЕРИОДА(СчетаДоверительногоУправления.ДатаРасторжения, ДЕНЬ)
		|		ИНАЧЕ &Период
		|	КОНЕЦ КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _СтратегииСчетовДоверительногоУправления
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК НачалоПериодаСтратегии
		|		ПО (НачалоПериодаСтратегии.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|			И (НачалоПериодаСтратегии.Организация = СчетаДоверительногоУправления.Организация)
		|			И (НачалоПериодаСтратегии.Период <= &Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтратегииИндивидуальногоИнвестирования КАК ОкончанияПериодаСтратегии
		|		ПО (ОкончанияПериодаСтратегии.СчетДоверительногоУправления = НачалоПериодаСтратегии.СчетДоверительногоУправления)
		|			И (ОкончанияПериодаСтратегии.Организация = НачалоПериодаСтратегии.Организация)
		|			И (ОкончанияПериодаСтратегии.Период > НачалоПериодаСтратегии.Период)
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И СчетаДоверительногоУправления.ДатаЗаключения <= &Период
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетаДоверительногоУправления.Ссылка,
		|	НачалоПериодаСтратегии.Стратегия,
		|	НачалоПериодаСтратегии.Период,
		|	СчетаДоверительногоУправления.ДатаРасторжения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СтратегииСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _ИзменившиеСтратегию
		|ИЗ
		|	_СтратегииСчетовДоверительногоУправления КАК _СтратегииСчетовДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			_СтратегииСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|		ИЗ
		|			_СтратегииСчетовДоверительногоУправления КАК _СтратегииСчетовДУ
		|		
		|		СГРУППИРОВАТЬ ПО
		|			_СтратегииСчетовДУ.СчетДоверительногоУправления
		|		
		|		ИМЕЮЩИЕ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _СтратегииСчетовДУ.Стратегия) > 1) КАК ИзменившиеСтратегию
		|		ПО (ИзменившиеСтратегию.СчетДоверительногоУправления = _СтратегииСчетовДУ.СчетДоверительногоУправления)
		|ГДЕ
		|	_СтратегииСчетовДУ.Стратегия = &Стратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СтратегииСчетовДУ.Стратегия КАК Стратегия,
		|	_СтратегииСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СтратегииСчетовДУ.НачалоПериода КАК НачалоПериода,
		|	МАКСИМУМ(_СтратегииСчетовДУ.ОкончаниеПериода) КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СтратегииСчетовДУ.Стратегия КАК Стратегия,
		|		_СтратегииСчетовДУ.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		МИНИМУМ(_СтратегииСчетовДУ.НачалоПериода) КАК НачалоПериода,
		|		_ТежеСтратегииСчетовДУ.ОкончаниеПериода КАК ОкончаниеПериода
		|	ИЗ
		|		_СтратегииСчетовДоверительногоУправления КАК _СтратегииСчетовДУ
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СтратегииСчетовДоверительногоУправления КАК _ТежеСтратегииСчетовДУ
		|			ПО (_ТежеСтратегииСчетовДУ.СчетДоверительногоУправления = _СтратегииСчетовДУ.СчетДоверительногоУправления)
		|				И (_ТежеСтратегииСчетовДУ.Стратегия = _СтратегииСчетовДУ.Стратегия)
		|				И (_ТежеСтратегииСчетовДУ.НачалоПериода >= _СтратегииСчетовДУ.НачалоПериода)
		|			ЛЕВОЕ СОЕДИНЕНИЕ _СтратегииСчетовДоверительногоУправления КАК _ДругиеСтратегииСчетовДУ
		|			ПО (_ДругиеСтратегииСчетовДУ.СчетДоверительногоУправления = _СтратегииСчетовДУ.СчетДоверительногоУправления)
		|				И (_ДругиеСтратегииСчетовДУ.Стратегия <> _СтратегииСчетовДУ.Стратегия)
		|				И (_ДругиеСтратегииСчетовДУ.НачалоПериода >= _СтратегииСчетовДУ.ОкончаниеПериода)
		|				И (_ДругиеСтратегииСчетовДУ.ОкончаниеПериода <= _ТежеСтратегииСчетовДУ.НачалоПериода)
		|	ГДЕ
		|		_ДругиеСтратегииСчетовДУ.Стратегия ЕСТЬ NULL
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СтратегииСчетовДУ.Стратегия,
		|		_СтратегииСчетовДУ.СчетДоверительногоУправления,
		|		_ТежеСтратегииСчетовДУ.ОкончаниеПериода) КАК _СтратегииСчетовДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	_СтратегииСчетовДУ.Стратегия,
		|	_СтратегииСчетовДУ.СчетДоверительногоУправления,
		|	_СтратегииСчетовДУ.НачалоПериода
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_СчетаДоверительногоУправления.Стратегия КАК Стратегия,
		|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) < _СчетаДоверительногоУправления.НачалоПериода
		|			ТОГДА _СчетаДоверительногоУправления.НачалоПериода
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|	КОНЕЦ КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) > _СчетаДоверительногоУправления.ОкончаниеПериода
		|			ТОГДА _СчетаДоверительногоУправления.ОкончаниеПериода
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ)
		|	КОНЕЦ КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления_СМесяцами
		|ИЗ
		|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ПО (ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский))
		|			И (ДанныеКалендаря.Дата МЕЖДУ _СчетаДоверительногоУправления.НачалоПериода И ДОБАВИТЬКДАТЕ(_СчетаДоверительногоУправления.ОкончаниеПериода, СЕКУНДА, -1))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДоверительногоУправления_СМесяцами.Стратегия КАК Стратегия,
		|	_СчетаДоверительногоУправления_СМесяцами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_СчетаДоверительногоУправления_СМесяцами.НачалоПериода КАК НачалоПериода,
		|	_СчетаДоверительногоУправления_СМесяцами.ОкончаниеПериода КАК ОкончаниеПериода,
		|	ЕСТЬNULL(_СчетаДоверительногоУправления_СМесяцами.Стратегия <> ОкончаниеСтратегии.Стратегия, ЛОЖЬ) КАК ОкончаниеСтратегии,
		|	ЕСТЬNULL(_СчетаДоверительногоУправления_СМесяцами.Стратегия <> НачалоСтатегии.Стратегия, ЛОЖЬ) КАК НачалоСтатегии,
		|	ВЫБОР
		|		КОГДА _СчетаДоверительногоУправления_СМесяцами.Стратегия <> ОкончаниеСтратегии.Стратегия
		|			ТОГДА _СчетаДоверительногоУправления_СМесяцами.ОкончаниеПериода
		|		КОГДА _СчетаДоверительногоУправления_СМесяцами.Стратегия <> НачалоСтатегии.Стратегия
		|			ТОГДА _СчетаДоверительногоУправления_СМесяцами.НачалоПериода
		|	КОНЕЦ КАК ПериодНачалаОкончанияСтатегии
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления_СПериодами
		|ИЗ
		|	_СчетаДоверительногоУправления_СМесяцами КАК _СчетаДоверительногоУправления_СМесяцами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК ОкончаниеСтратегии
		|		ПО _СчетаДоверительногоУправления_СМесяцами.СчетДоверительногоУправления = ОкончаниеСтратегии.СчетДоверительногоУправления
		|			И _СчетаДоверительногоУправления_СМесяцами.ОкончаниеПериода = ОкончаниеСтратегии.НачалоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК НачалоСтатегии
		|		ПО _СчетаДоверительногоУправления_СМесяцами.СчетДоверительногоУправления = НачалоСтатегии.СчетДоверительногоУправления
		|			И _СчетаДоверительногоУправления_СМесяцами.НачалоПериода = НачалоСтатегии.ОкончаниеПериода
		|ГДЕ
		|	_СчетаДоверительногоУправления_СМесяцами.Стратегия.Стандартная
		|	И _СчетаДоверительногоУправления_СМесяцами.Стратегия = &Стратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Стратегия КАК Стратегия,
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.НачалоПериода, МЕСЯЦ) КАК НачалоМесяца,
		|	ВЫБОР
		|		КОГДА КОНЕЦПЕРИОДА(ВложенныйЗапрос.ОкончаниеПериода, МЕСЯЦ) > &Период
		|			ТОГДА &Период
		|		ИНАЧЕ КОНЕЦПЕРИОДА(ВложенныйЗапрос.ОкончаниеПериода, МЕСЯЦ)
		|	КОНЕЦ КАК ОкончаниеМесяца,
		|	СУММА(ВложенныйЗапрос.ДляСреднего) КАК ДляСреднего,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	ВложенныйЗапрос.ОкончаниеСтратегии КАК ОкончаниеСтратегии,
		|	ВложенныйЗапрос.НачалоСтатегии КАК НачалоСтатегии
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	(ВЫБРАТЬ
		|		_СчетаДоверительногоУправления_СПериодами.Стратегия КАК Стратегия,
		|		_СчетаДоверительногоУправления_СПериодами.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоПериода КАК НачалоПериода,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеПериода КАК ОкончаниеПериода,
		|		СУММА(ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот * ВЫБОР
		|				КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ * (РАЗНОСТЬДАТ(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, КОНЕЦПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Период, МЕСЯЦ), ДЕНЬ) + 1)) КАК ДляСреднего,
		|		СУММА(ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот * ВЫБОР
		|				КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ * ВЫБОР
		|				КОГДА ВводыВыводыАктивовВВалютеУчетаОбороты.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
		|					ТОГДА -1
		|				ИНАЧЕ 1
		|			КОНЕЦ) КАК Сумма,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеСтратегии КАК ОкончаниеСтратегии,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоСтатегии КАК НачалоСтатегии
		|	ИЗ
		|		_СчетаДоверительногоУправления_СПериодами КАК _СчетаДоверительногоУправления_СПериодами
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|					,
		|					&Период,
		|					День,
		|					Организация = &Организация
		|						И СчетДоверительногоУправления В
		|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|								Т.СчетДоверительногоУправления
		|							ИЗ
		|								_СчетаДоверительногоУправления_СПериодами КАК Т)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|			ПО _СчетаДоверительногоУправления_СПериодами.СчетДоверительногоУправления = ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления
		|				И (ВводыВыводыАктивовВВалютеУчетаОбороты.Период МЕЖДУ _СчетаДоверительногоУправления_СПериодами.НачалоПериода И _СчетаДоверительногоУправления_СПериодами.ОкончаниеПериода)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_СчетаДоверительногоУправления_СПериодами.Стратегия,
		|		_СчетаДоверительногоУправления_СПериодами.СчетДоверительногоУправления,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоПериода,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеПериода,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеСтратегии,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоСтатегии
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		_СчетаДоверительногоУправления_СПериодами.Стратегия,
		|		_СчетаДоверительногоУправления_СПериодами.СчетДоверительногоУправления,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоПериода,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеПериода,
		|		ВЫБОР
		|			КОГДА _СчетаДоверительногоУправления_СПериодами.ОкончаниеСтратегии
		|				ТОГДА -ФинансовыеПоказатели.Значение
		|			КОГДА _СчетаДоверительногоУправления_СПериодами.НачалоСтатегии
		|				ТОГДА ФинансовыеПоказатели.Значение
		|		КОНЕЦ * (РАЗНОСТЬДАТ(ФинансовыеПоказатели.Период, КОНЕЦПЕРИОДА(ФинансовыеПоказатели.Период, МЕСЯЦ), ДЕНЬ) + 1),
		|		ВЫБОР
		|			КОГДА _СчетаДоверительногоУправления_СПериодами.ОкончаниеСтратегии
		|				ТОГДА -ФинансовыеПоказатели.Значение
		|			КОГДА _СчетаДоверительногоУправления_СПериодами.НачалоСтатегии
		|				ТОГДА ФинансовыеПоказатели.Значение
		|		КОНЕЦ,
		|		_СчетаДоверительногоУправления_СПериодами.ОкончаниеСтратегии,
		|		_СчетаДоверительногоУправления_СПериодами.НачалоСтатегии
		|	ИЗ
		|		_СчетаДоверительногоУправления_СПериодами КАК _СчетаДоверительногоУправления_СПериодами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|			ПО (ФинансовыеПоказатели.СубъектАналитики = _СчетаДоверительногоУправления_СПериодами.СчетДоверительногоУправления)
		|				И (ФинансовыеПоказатели.Организация = &Организация)
		|				И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|				И (ФинансовыеПоказатели.Период = _СчетаДоверительногоУправления_СПериодами.ПериодНачалаОкончанияСтатегии)) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Стратегия,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.НачалоПериода,
		|	ВложенныйЗапрос.ОкончаниеПериода,
		|	ВложенныйЗапрос.ОкончаниеСтратегии,
		|	ВложенныйЗапрос.НачалоСтатегии
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВводыВыводы.Стратегия КАК Стратегия,
		|	_ВводыВыводы.НачалоМесяца КАК НачалоМесяца,
		|	_ВводыВыводы.ОкончаниеМесяца КАК ОкончаниеМесяца,
		|	СУММА(ФинансовыеПоказателиНаНачало.Значение) КАК СЧАНаНачало,
		|	СУММА(ЕСТЬNULL(_ВводыВыводы.Сумма, 0)) КАК ВводыВыводы,
		|	СУММА(ФинансовыеПоказателиНаКонец.Значение) КАК СЧАНаКонец,
		|	СУММА(ЕСТЬNULL(ФинансовыеПоказателиНаКонец.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.Сумма, 0) - ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0)) КАК ФинРез,
		|	СУММА((ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0) * ДЕНЬ(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, МЕСЯЦ)) + ЕСТЬNULL(_ВводыВыводы.ДляСреднего, 0)) / ДЕНЬГОДА(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, ГОД))) КАК СреднегодоваяСтоимость,
		|	ВЫБОР
		|		КОГДА СУММА((ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0) * ДЕНЬ(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, МЕСЯЦ)) + ЕСТЬNULL(_ВводыВыводы.ДляСреднего, 0)) / ДЕНЬГОДА(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, ГОД))) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ЕСТЬNULL(ФинансовыеПоказателиНаКонец.Значение, 0) - ЕСТЬNULL(_ВводыВыводы.Сумма, 0) - ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0)) * 100 / СУММА((ЕСТЬNULL(ФинансовыеПоказателиНаНачало.Значение, 0) * ДЕНЬ(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, МЕСЯЦ)) + ЕСТЬNULL(_ВводыВыводы.ДляСреднего, 0)) / ДЕНЬГОДА(КОНЕЦПЕРИОДА(_ВводыВыводы.НачалоМесяца, ГОД)))
		|	КОНЕЦ КАК ДоходностьЗаМесяц
		|ПОМЕСТИТЬ _ФинРез_ВесьПериод
		|ИЗ
		|	_ВводыВыводы КАК _ВводыВыводы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиНаНачало
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ВводыВыводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|				_ВводыВыводы.НачалоМесяца КАК НачалоМесяца,
		|				МАКСИМУМ(ФинансовыеПоказателиНаНачало.Период) КАК Период
		|			ИЗ
		|				_ВводыВыводы КАК _ВводыВыводы
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиНаНачало
		|					ПО (ФинансовыеПоказателиНаНачало.СубъектАналитики = _ВводыВыводы.СчетДоверительногоУправления)
		|						И (ФинансовыеПоказателиНаНачало.Организация = &Организация)
		|						И (ФинансовыеПоказателиНаНачало.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|						И (ФинансовыеПоказателиНаНачало.Период < _ВводыВыводы.НачалоМесяца)
		|						И (НЕ _ВводыВыводы.НачалоСтатегии)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ВводыВыводы.СчетДоверительногоУправления,
		|				_ВводыВыводы.НачалоМесяца) КАК ПериодФинансовыеПоказателиНаНачало
		|			ПО ФинансовыеПоказателиНаНачало.СубъектАналитики = ПериодФинансовыеПоказателиНаНачало.СчетДоверительногоУправления
		|				И (ФинансовыеПоказателиНаНачало.Организация = &Организация)
		|				И (ФинансовыеПоказателиНаНачало.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|				И ФинансовыеПоказателиНаНачало.Период = ПериодФинансовыеПоказателиНаНачало.Период
		|		ПО (ФинансовыеПоказателиНаНачало.СубъектАналитики = _ВводыВыводы.СчетДоверительногоУправления)
		|			И (ПериодФинансовыеПоказателиНаНачало.НачалоМесяца = _ВводыВыводы.НачалоМесяца)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиНаКонец
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_ВводыВыводы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|				_ВводыВыводы.ОкончаниеМесяца КАК ОкончаниеМесяца,
		|				МАКСИМУМ(ФинансовыеПоказателиНаКонец.Период) КАК Период
		|			ИЗ
		|				_ВводыВыводы КАК _ВводыВыводы
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиНаКонец
		|					ПО (ФинансовыеПоказателиНаКонец.СубъектАналитики = _ВводыВыводы.СчетДоверительногоУправления)
		|						И (ФинансовыеПоказателиНаКонец.Организация = &Организация)
		|						И (ФинансовыеПоказателиНаКонец.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|						И (ФинансовыеПоказателиНаКонец.Период <= _ВводыВыводы.ОкончаниеМесяца)
		|						И (НЕ _ВводыВыводы.ОкончаниеСтратегии)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_ВводыВыводы.СчетДоверительногоУправления,
		|				_ВводыВыводы.ОкончаниеМесяца) КАК ПериодФинансовыеПоказателиНаКонец
		|			ПО ФинансовыеПоказателиНаКонец.СубъектАналитики = ПериодФинансовыеПоказателиНаКонец.СчетДоверительногоУправления
		|				И (ФинансовыеПоказателиНаКонец.Организация = &Организация)
		|				И (ФинансовыеПоказателиНаКонец.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|				И ФинансовыеПоказателиНаКонец.Период = ПериодФинансовыеПоказателиНаКонец.Период
		|		ПО (ФинансовыеПоказателиНаКонец.СубъектАналитики = _ВводыВыводы.СчетДоверительногоУправления)
		|			И (ПериодФинансовыеПоказателиНаКонец.ОкончаниеМесяца = _ВводыВыводы.ОкончаниеМесяца)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ВводыВыводы.Стратегия,
		|	_ВводыВыводы.НачалоМесяца,
		|	_ВводыВыводы.ОкончаниеМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ФинРез_ВесьПериод.Стратегия КАК Стратегия,
		|	_ФинРез_ВесьПериод.ОкончаниеМесяца КАК Период,
		|	_ФинРез_ВесьПериод.СЧАНаНачало КАК СЧАНаНачало,
		|	_ФинРез_ВесьПериод.ВводыВыводы КАК ВводыВыводы,
		|	_ФинРез_ВесьПериод.СЧАНаКонец КАК СЧАНаКонец,
		|	_ФинРез_ВесьПериод.ФинРез КАК ФинРез,
		|	_ФинРез_ВесьПериод.СреднегодоваяСтоимость КАК СреднегодоваяСтоимость,
		|	_ФинРез_ВесьПериод.ДоходностьЗаМесяц КАК ДоходностьЗаМесяц,
		|	СРЕДНЕЕ(_ФинРез_ВесьПериод1.ДоходностьЗаМесяц) КАК СреднемесячнаяДоходность
		|ИЗ
		|	_ФинРез_ВесьПериод КАК _ФинРез_ВесьПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ФинРез_ВесьПериод КАК _ФинРез_ВесьПериод1
		|		ПО _ФинРез_ВесьПериод.Стратегия = _ФинРез_ВесьПериод1.Стратегия
		|			И _ФинРез_ВесьПериод.НачалоМесяца >= _ФинРез_ВесьПериод1.НачалоМесяца
		|
		|СГРУППИРОВАТЬ ПО
		|	_ФинРез_ВесьПериод.Стратегия,
		|	_ФинРез_ВесьПериод.ОкончаниеМесяца,
		|	_ФинРез_ВесьПериод.ФинРез,
		|	_ФинРез_ВесьПериод.СЧАНаНачало,
		|	_ФинРез_ВесьПериод.ВводыВыводы,
		|	_ФинРез_ВесьПериод.СЧАНаКонец,
		|	_ФинРез_ВесьПериод.СреднегодоваяСтоимость,
		|	_ФинРез_ВесьПериод.ДоходностьЗаМесяц
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ФинРез_ВесьПериод.ОкончаниеМесяца";
	
	СреднемесячнаяДоходность							= 0;
	СтоимостьИмуществаПереданногоВУправлениеКонтрольная	= 0;
	
	РасшифровкаСреднемесячнойДоходности = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СреднемесячнаяДоходность							= Выборка.СреднемесячнаяДоходность;
		СтоимостьИмуществаПереданногоВУправлениеКонтрольная	= СтоимостьИмуществаПереданногоВУправлениеКонтрольная + Выборка.ВводыВыводы;
		
		ЭлементРасшифровки = Новый Структура("Период, СЧАНаНачало, ВводыВыводы, СЧАНаКонец, ФинРез, СреднегодоваяСтоимость, ДоходностьЗаМесяц, СреднемесячнаяДоходность");
		ЗаполнитьЗначенияСвойств(ЭлементРасшифровки, Выборка);
		РасшифровкаСреднемесячнойДоходности.Добавить(ЭлементРасшифровки);
		
	КонецЦикла;
	
	#КонецОбласти

	#Область Контрольные_проверки
	
	ИзменившиеСтратегию = Запрос.МенеджерВременныхТаблиц.Таблицы["_ИзменившиеСтратегию"].ПолучитьДанные();
	
	Если ИзменившиеСтратегию.Пустой() Тогда
		
		// Когда стратегию не меняли, сумма вводов/выводов при расчете дохода и среднемесячной доходности должна совпадать	
		
		Если СтоимостьИмуществаПереданногоВУправление <> СтоимостьИмуществаПереданногоВУправлениеКонтрольная Тогда
			
			ВызватьИсключение СтрШаблон("Различается сумма имущества, переданного в управление, в расчетах дохода (%1) и среднемесячной доходности (%2)!",
				СтоимостьИмуществаПереданногоВУправление,
				СтоимостьИмуществаПереданногоВУправлениеКонтрольная);
			
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	Доход		= СтоимостьПортфеля - СтоимостьИмуществаПереданногоВУправление;
	Доходность	= Доход / СредняяСтоимостьИмуществаПереданногоВУправление * 100;
	
	Если РасшифровкаРасчета Тогда
		
		ФинансовыеПоказатели = Новый Структура;
		ФинансовыеПоказатели.Вставить("Стратегия",									Строка(Стратегия));
		ФинансовыеПоказатели.Вставить("ОтчетнаяДата",								Формат(Период, "ДЛФ=D"));
		ФинансовыеПоказатели.Вставить("ИтогоПереданоВДУ",							Формат(СтоимостьИмуществаПереданногоВУправление, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("СредняяСтоимостьИмущества",					Формат(СредняяСтоимостьИмуществаПереданногоВУправление, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("СтоимостьПортфеля",							Формат(СтоимостьПортфеля, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("Доход",										Формат(Доход, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("Доходность",									Формат(Доходность, "ЧДЦ=2"));
		
		ФинансовыеПоказатели.Вставить("СреднемесячнаяДоходность",					Формат(СреднемесячнаяДоходность, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("РасшифровкаСреднемесячнойДоходности",		РасшифровкаСреднемесячнойДоходности);
		
		ФинансовыеПоказатели.Вставить("Операции",									Операции);
		ФинансовыеПоказатели.Вставить("РасшифровкаСтоимостиПортфеля",				РасшифровкаСтоимостиПортфеля);
		
		ФинансовыеПоказатели.Вставить("СтоимостьПортфеляЗарегистрировано",			Формат(СтоимостьПортфеляЗарегистрировано, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("ДоходЗарегистрировано",						Формат(ДоходЗарегистрировано, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("ДоходностьЗарегистрировано",					Формат(ДоходностьЗарегистрировано, "ЧДЦ=2"));
		ФинансовыеПоказатели.Вставить("СреднемесячнаяДоходностьЗарегистрировано",	Формат(СреднемесячнаяДоходностьЗарегистрировано, "ЧДЦ=2"));
		
	Иначе
		
		ФинансовыеПоказатели = Новый Соответствие;
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СтоимостьПортфеля,			СтоимостьПортфеля);
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доход,						Доход);
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.СтандартныеСтратегии_Доходность,				Доходность);
		ФинансовыеПоказатели.Вставить(Справочники.ВидыФинансовыхПоказателей.СтандартныеСтратегии_СреднемесячнаяДоходность,	СреднемесячнаяДоходность);
		
		Если Документы.РегистрацияСтоимостиАктивов.ТребуетсяРегистрацияДоходностиСтратегииСНачалаГода(Организация, Стратегия, Период) Тогда
			Отказ = Ложь;
			
			РасчетДоходностиСтратегииСНачалаГода = Документы.РегистрацияСтоимостиАктивов.РассчитатьДоходностьСтратегииСНачалаГода(Организация, Стратегия, Период, Ложь, Отказ);
			Если Отказ = Ложь Тогда
				Для Каждого ДоходностьСтратегииСНачалаГода Из РасчетДоходностиСтратегииСНачалаГода Цикл
					ФинансовыеПоказатели.Вставить(ДоходностьСтратегииСНачалаГода.Ключ, ДоходностьСтратегииСНачалаГода.Значение);
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ФинансовыеПоказатели;
	
КонецФункции

Функция ЗапретРедактированияДокумента(Документ, Отказ, СообщатьОбОтказе = Истина, ТекстСообщения = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", 	Документ.Организация);
	Запрос.УстановитьПараметр("Дата",			Документ.Дата);
	
	РегистрыСведений.ДатыЗапретаРедактирования.ПоместитьВЗапросДатыЗапретаРедактированияКонтролера(Запрос);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыЗапретаРедактированияКонтролера.Организация КАК Организация,
		|	_ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования КАК ДатаЗапретаРедактирования
		|ИЗ
		|	_ДатыЗапретаРедактированияКонтролера КАК _ДатыЗапретаРедактированияКонтролера
		|ГДЕ
		|	_ДатыЗапретаРедактированияКонтролера.Организация = &Организация
		|	И _ДатыЗапретаРедактированияКонтролера.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоУправлениюЦеннымиБумагами)
		|	И _ДатыЗапретаРедактированияКонтролера.ДатаЗапретаРедактирования >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запрет = Не РезультатЗапроса.Пустой();
	
	Если Запрет Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения =
				СтрШаблон("Редактирование документа запрещено, т.к. его дата меньше либо равна дате запрета редактирования контролёра (%1)",
					Формат(Выборка.ДатаЗапретаРедактирования, "ДФ=dd.MM.yyyy"));
			
			Если СообщатьОбОтказе Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ, "Дата");
			КонецЕсли;
			
		КонецЦикла;
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Возврат Запрет;
	
КонецФункции
